# notification-processor - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda_notification_v1_event.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/notification_processor_notification_v1_event]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/notification_processor_notification_v1_event_retry_0]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/notification_processor_customer_v1_event_retry_0]
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_customer_v1_event.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/notification_processor_customer_v1_event]
module.common_resources.module.aws_lambda_notification_v1_event.aws_iam_role.lambda_role: Refreshing state... [id=le-notification_processor_notification_v1_event]
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Read complete after 0s [id=upstash_kafka_credential_secret_name]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role.lambda_role: Refreshing state... [id=le-notification_processor_customer_v1_event_retry_0]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_iam_role.lambda_role: Refreshing state... [id=le-notification_processor_notification_v1_event_retry_0]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=713821e5-fed9-4082-a0c7-406a4f9b0c57:notification_processor]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 1s [id=upstash-cluster-cd2221c9-e9d6-4e4b-b87a-503beb130df1]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role.lambda_role: Refreshing state... [id=le-notification_processor_customer_v1_event]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 1s [id=upstash-kafka-credential-42067792-8b6c-4c27-b34e-d1daed82d943]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-notification_processor_notification_v1_event-20230527203643456000000004]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_iam_role_policy_attachment.default: Refreshing state... [id=le-notification_processor_notification_v1_event_retry_0-20230527203643262700000002]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy_attachment.default: Refreshing state... [id=le-notification_processor_customer_v1_event_retry_0-20230527203643282000000003]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-notification_processor_customer_v1_event-20230527203643230600000001]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_191092-f5XKok]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=213115978]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=213115978]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-notification_processor_customer_v1_event:lambda-secrets-policy-notification_processor_customer_v1_event]
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=213115978]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=213115978]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-notification_processor_customer_v1_event_retry_0:lambda-secrets-policy-notification_processor_customer_v1_event_retry_0]
module.common_resources.module.aws_lambda_notification_v1_event.aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-notification_processor_notification_v1_event:lambda-secrets-policy-notification_processor_notification_v1_event]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-notification_processor_notification_v1_event_retry_0:lambda-secrets-policy-notification_processor_notification_v1_event_retry_0]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Read complete after 3s [id=32fa5432022727240bf749d0bf9b92ca34e33475]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.archive_file.default: Read complete after 3s [id=7355621319d9c4bf26473764b1296ee173130dbf]
module.common_resources.module.aws_lambda_notification_v1_event.data.archive_file.default: Read complete after 4s [id=7355621319d9c4bf26473764b1296ee173130dbf]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_lambda_function.default: Refreshing state... [id=notification_processor_notification_v1_event_retry_0]
module.common_resources.module.aws_lambda_notification_v1_event.aws_lambda_function.default: Refreshing state... [id=notification_processor_notification_v1_event]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_lambda_function.default: Refreshing state... [id=notification_processor_customer_v1_event_retry_0]
module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Read complete after 4s [id=32fa5432022727240bf749d0bf9b92ca34e33475]
module.common_resources.module.aws_lambda_customer_v1_event.aws_lambda_function.default: Refreshing state... [id=notification_processor_customer_v1_event]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_notification_v1_event_retry_topics[0]: Refreshing state... [id=0fb4ea33-c563-4efb-9aab-e690de65ca5f]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_retry_topics[0]: Refreshing state... [id=e4d30f63-b197-4d55-bb36-18acf9c2c953]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_topic: Refreshing state... [id=c05d87f3-db7a-49ba-9cd5-ddc389fdfa73]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_notification_v1_event_topic: Refreshing state... [id=3c377969-bf2c-4ce0-924f-115fcf4844c7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda_customer_v1_event.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "notification_processor_customer_v1_event"
        tags                           = {
            "domain"        = "notification"
            "environment"   = "staging"
            "resource"      = "notification-processor"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "precious-raccoon-9266-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "115af9d0060146689ccdfbd8a39688e2"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "cHJlY2lvdXMtcmFjY29vbi05MjY2JPUcwBKiDajJ1_PyzpCvK5iTwQi8olRl9UA"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "notification_processor_customer_v1_event_retry_0"
        tags                           = {
            "domain"        = "notification"
            "environment"   = "staging"
            "resource"      = "notification-processor"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "precious-raccoon-9266-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "115af9d0060146689ccdfbd8a39688e2"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "cHJlY2lvdXMtcmFjY29vbi05MjY2JPUcwBKiDajJ1_PyzpCvK5iTwQi8olRl9UA"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_notification_v1_event.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "notification_processor_notification_v1_event"
        tags                           = {
            "domain"        = "notification"
            "environment"   = "staging"
            "resource"      = "notification-processor"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "precious-raccoon-9266-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "115af9d0060146689ccdfbd8a39688e2"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "cHJlY2lvdXMtcmFjY29vbi05MjY2JPUcwBKiDajJ1_PyzpCvK5iTwQi8olRl9UA"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "notification_processor_notification_v1_event_retry_0"
        tags                           = {
            "domain"        = "notification"
            "environment"   = "staging"
            "resource"      = "notification-processor"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "precious-raccoon-9266-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "115af9d0060146689ccdfbd8a39688e2"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "cHJlY2lvdXMtcmFjY29vbi05MjY2JPUcwBKiDajJ1_PyzpCvK5iTwQi8olRl9UA"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "notification"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "notification_processor"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "713821e5-fed9-4082-a0c7-406a4f9b0c57:notification_processor"
        name       = "notification_processor"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "5a3062e2-279a-47ad-880d-175c4cad8f56" -> "ca752135-2860-42c0-a870-9798e6aa8272"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*